app/Controllers/Admin/Config.php

    public function add_jumlah_click(){
        helper(['form']);
        $rules = [
            'id_games' => 'required',
        ];

        if($this->validate($rules)){
            $db = \Config\Database::connect();
            $builder = $db->table('jumlah_klik');

            $builder->where('id_games', $this->request->getVar('id_games'));
            $get = $builder->get()->getRowArray();

            if ($get) {
                $data = [
                    'id_games' => $this->request->getVar('id_games'),
                    'jumlah_klik' => $get['jumlah_klik'] + 1,
                ];
                $builder->set($data);
                $builder->where('id_games', $this->request->getVar('id_games'));
                $builder->update();
---
SELECT *
FROM `jumlah_klik`
WHERE `id_games` = '110'
UPDATE `jumlah_klik` SET `id_games` = '110', `jumlah_klik` = 24136
WHERE `id_games` = '110'