app/Controllers/BaseController.php


        $builderconfig = $this->db->table('config');
        $builderconfig->where('nama', 'tawkto');
        $configpopuler = $builderconfig->get()->getRowArray();

        $filterconfig = $this->db->table('config');
        $filterconfig->where('nama', 'blackwhitefilterpopuler');
        $configfilterpopuler = $filterconfig->get()->getRowArray();

        $buildertatacara = $this->db->table('tata_cara_kategory');
        $tatacara = $buildertatacara->get()->getResultArray();

        $buildertatacara = $this->db->table('utility');
        $utility = $buildertatacara->get()->getResultArray();
---
SELECT *
FROM `config`
WHERE `nama` = 'tawkto'
SELECT *
FROM `config`
WHERE `nama` = 'blackwhitefilterpopuler'
SELECT *
FROM `tata_cara_kategory`
SELECT *
FROM `utility`