app/Controllers/Home.php

SELECT *
FROM `config`
WHERE `nama` = 'populer'
---

        $builderconfig = $this->db->table('config');
        $builderconfig->where('nama', 'populer');
        $configpopuler = $builderconfig->get()->getRowArray();