app/Models/M_Base.php

SELECT *
FROM `utility`
WHERE `u_key` = 'digi-user'
---
	public function u_get($key) {
		return $this->db->table('utility')->where('u_key', $key)->get()->getResultArray()[0]['u_value'];